In [1]:
import pandas as pd

In [3]:
customer_df = pd.read_sas('Customer_Segmentation_Data.sas7bdat')
value_df = pd.read_sas('a2z_insurance.sas7bdat')

print(customer_df.shape)
print(value_df.shape)

(9000, 18)
(10296, 14)

In [4]:
customer_df.head()

,Custid,Age,Income,Frq,Rcn,Mnt,Clothes,Kitchen,SmallAppliances,Toys,HouseKeeping,Education,Marital_Status,Gender,Dependents,PerNetPurch,PerCatPurch,Recomendation
0,10622.0,1951.0,95964.0,38.0,83.0,1603.0,69.0,1.0,28.0,1.0,1.0,b'Graduation',b'Whatever',b'M',1.0,34.0,66.0,5.0
1,3968.0,1937.0,97407.0,27.0,71.0,1139.0,52.0,0.0,41.0,1.0,6.0,b'Master',b'Whatever',b'F',0.0,20.0,80.0,4.0
2,9731.0,1978.0,73509.0,25.0,97.0,768.0,49.0,6.0,29.0,8.0,7.0,b'Master',b'Whatever',b'M',1.0,52.0,48.0,3.0
3,9970.0,1957.0,75733.0,20.0,74.0,597.0,68.0,5.0,15.0,4.0,8.0,b'Master',b'Whatever',b'M',1.0,30.0,70.0,3.0
4,4732.0,1960.0,84938.0,24.0,78.0,704.0,95.0,0.0,4.0,0.0,1.0,b'Master',b'Whatever',b'M',1.0,56.0,44.0,3.0

In [5]:
value_df.head()

,CustID,FirstPolYear,BirthYear,EducDeg,MonthSal,GeoLivArea,Children,CustMonVal,ClaimsRate,PremMotor,PremHousehold,PremHealth,PremLife,PremWork
0,1.0,1985.0,1982.0,b'2 - High School',2177.0,1.0,1.0,380.97,0.39,375.85,79.45,146.36,47.01,16.89
1,2.0,1981.0,1995.0,b'2 - High School',677.0,4.0,1.0,-131.13,1.12,77.46,416.20,116.69,194.48,106.13
2,3.0,1991.0,1970.0,b'1 - Basic',2277.0,3.0,0.0,504.67,0.28,206.15,224.50,124.58,86.35,99.02
3,4.0,1990.0,1981.0,b'3 - BSc/MSc',1099.0,4.0,1.0,-16.99,0.99,182.48,43.35,311.17,35.34,28.34
4,5.0,1986.0,1973.0,b'3 - BSc/MSc',1763.0,4.0,1.0,35.23,0.90,338.62,47.80,182.59,18.78,41.45

In [16]:
total = pd.merge(value_df, customer_df, how='left', left_on='CustID', right_on='Custid')

print(total.shape)

(10296, 32)

In [17]:
total.head()

,CustID,FirstPolYear,BirthYear,EducDeg,MonthSal,GeoLivArea,Children,CustMonVal,ClaimsRate,PremMotor,...,SmallAppliances,Toys,HouseKeeping,Education,Marital_Status,Gender,Dependents,PerNetPurch,PerCatPurch,Recomendation
0,1.0,1985.0,1982.0,b'2 - High School',2177.0,1.0,1.0,380.97,0.39,375.85,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2.0,1981.0,1995.0,b'2 - High School',677.0,4.0,1.0,-131.13,1.12,77.46,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3.0,1991.0,1970.0,b'1 - Basic',2277.0,3.0,0.0,504.67,0.28,206.15,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4.0,1990.0,1981.0,b'3 - BSc/MSc',1099.0,4.0,1.0,-16.99,0.99,182.48,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5.0,1986.0,1973.0,b'3 - BSc/MSc',1763.0,4.0,1.0,35.23,0.90,338.62,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
print(total.isna().sum())

CustID                0
FirstPolYear         30
BirthYear            17
EducDeg              17
MonthSal             36
GeoLivArea            1
Children             21
CustMonVal            0
ClaimsRate            0
PremMotor            34
PremHousehold         0
PremHealth           43
PremLife            104
PremWork             86
Custid             1925
Age                1925
Income             1965
Frq                1925
Rcn                1925
Mnt                1925
Clothes            1925
Kitchen            1925
SmallAppliances    1925
Toys               1925
HouseKeeping       1925
Education          1971
Marital_Status     2094
Gender             1925
Dependents         2184
PerNetPurch        1925
PerCatPurch        1925
Recomendation      1925
dtype: int64